Revit 2027 API
AnalyticalModelSelector(Curve) Constructor
 Creates a selector based on a specific analytical curve.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalModelSelector(
	Curve curve
)
Public Sub New (
	curve As Curve
)
public:
AnalyticalModelSelector(
	Curve^ curve
)
new :
        curve : Curve -> AnalyticalModelSelector
Parameters
curve Curve
 The curve upon which this selector acts.
Exceptions
Exception | Condition
ArgumentException |  The input curve points to a helical curve and is not supported for this operation.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalModelSelector Class
AnalyticalModelSelector Overload
Autodesk.Revit.DB.Structure Namespace